"""
Реализовать функцию my_func(), которая принимает три позиционных
аргумента, и возвращает сумму наибольших двух аргументов.
"""

def sum_of_2_biggist(a, b, c):
    if



    for i in d:
        if i >= d[:2]:
            x = i
            print ("Hi", x)


sum_of_2_biggist(1, 6, 8)