"""
Поработайте с переменными, создайте несколько,
выведите на экран, запросите у пользователя несколько
чисел и строк и сохраните в переменные, выведите на экран.

"""

var1 = 1
var2 = "текст"
var3 = True
var4 = 2.3

print('Переменная №1 - ', var1, '\nПеременная №2 - ', var2, '\nПеременная №3 - ', var3, '\nПеременная №4 - ', var4)

var5 = input('Введите число:\n')
var6 = input('Введите ещё одно число:\n')
var7 = input('Введите произвольный текст:\n')

print('Вот пользовательские переменные №5, №6, №7')
print('Переменная №5 - ', var5)
print('Переменная №6 - ', var6)
print('Переменная №7 - ', var7)